{"pageProps":{"postData":{"id":"2011-12-30-blog-post.html","contentHtml":"<ul>\n<li>เกียรติยศย่อมเกิดจากการกระทำที่สุจริต  </li>\n<li>ถ้าคุณหัวเสีย คุณจะเสียหัว  </li>\n<li>อย่าไล่สุนัขให้จนตรอก อย่าต้อนคนให้จนมุม  </li>\n<li>อำนาจที่ปราศจากเหตุผล คือ อำนาจของคนพาล อำนาจที่ปราศจากความเมตตา คือ อำนาจที่นำมาซึ่งความปราชัย  </li>\n<li>ถ้าคุณคิดจะเป็นใหญ่ คุณก็จะได้เป็นใหญ ถ้าคุณคิดอยากเป็นอะไร คุณก็จะได้เป็นสิ่งนั้น  </li>\n<li>เพราะแสวงหา มิใช่เพราะรอคอย เพราะเชี่ยวชาญ มิใช่เพราะโอกาส เพราะสามารถ มิใช่เพราะโชคช่วย ดังนี้แล้ว \"ลิขิตฟ้าหรือจะสู้มานะตน\"  </li>\n<li>นกทำรังให้ดูไม้ ข้าเลือกนายให้ดูน้ำใจ  </li>\n<li>ผู้ ที่ยิ่งใหญ่ที่สุด คือ ผู้ที่ทำตนให้เล็กที่สุด ผู้ที่เล็กที่สุดก็จะกลายเป็นผู้ที่ใหญ่ที่สุด ผู้ที่มีเกียรติ คือ ผู้ที่ให้เกียรติผู้อื่น  </li>\n<li>จริงคือลวง ลวงคือจริง ถ้าคุณคิดว่าข้าศึกมีทางเลือกเพียง 2 ทาง จงแน่ใจได้ว่าเขาจะเลือกทางที่ 3  </li>\n<li>ถ้าสติไม่มา ปัญญาก็ไม่มี  </li>\n<li>มังกรถ้าไร้หัว หางก็ตีกันเอง ถ้าคานบนเอน คานล่างก็เบี้ยว ถ้าเสาเอกเฉียง เสาโทก็เฉ  </li>\n<li>คนมองไม่เห็นการณ์ไกล ภัยก็จะมาถึงตัว คนไม่รู้จักตัดไฟ ภัยก็จะน่ากลัว  </li>\n<li>ยามเรืองรุ่งพุ่งเปรี้ยงดุจเสียงฟ้า แม้เทวายังสยบหลบทางให้ จะหยิบดาวเดือนชมก็สมใจ คงร้องให้วันหนึ่งแน่ คราวแพ้มี  </li>\n<li>ไม้คดใช้ทำขอเหล็กงอใช้ทำเคียว แต่ คนคดเคี้ยวใช้ทำอะไรไม่ได้เลย  </li>\n<li>เล่นหมากรุก อย่าเอาแต่บุกอย่างเดียว เดินหมากรุกยังต้องคิด เดินหมากชีวิต จะไม่คิดได้อย่างไร  </li>\n<li>เมื่อเสียหลักก็ต้องหลบอย่างฉลาด เมื่อพลั้งพลาดต้องรู้หลึกใส่ปลีกหาง ค่อย ๆ คิด ค่อย ๆทำ ค่อยคลำทาง จึงจะย่างสู่จุดหมายเมื่อปลายมือ  </li>\n<li>ปลาใหญ่มักตายน้ำตื้น  </li>\n<li>เกียรติยศย่อมเกิดจากการกระทำที่สุจริต  </li>\n<li>ถ้าสติไม่มา ปัญญาก็ไม่มี  </li>\n<li>เมื่อใครสักคนหนึ่ง ทำผิด ท่านอย่าเพิ่งตำหนิหรือต่อว่าเขา เพราะถ้าท่านเป็นเขาและตกอยู่ในสภาพแวดล้อมเช่นเดียว กับเขา ท่านอาจจะตัดสินใจทำเช่นเดียวกับเขาก็ได้  </li>\n<li>การบริหารคือการทำงานให้สำเร็จโดยอาศัยมือผู้อื่น  </li>\n<li>ผู้ปกครองระดับธรรมดา ใช้ความสารมารถของตนอย่างเต็มที่ ผู้ปกครองระดับกลาง ใช้กำลังของคนอื่นอย่างเต็มที่ ผู้ปกครองระดับสูง ใช้ปัญญาของคนอื่นอย่างเต็มที่  </li>\n<li>อ่านคนออก บอกคนได้ ใช้คนเป็น  </li>\n<li>เมื่อนักการฑูตพูดว่า \"ใช่ หรือ อาจจะ\" เขามีความหมายว่า \"อาจจะ\" เมื่อนักการฑูตพูดว่า \"อาจจะ\" เขามีความหมายว่า \"ไม่\" เมื่อนักการฑูตพูดว่า \"ไม่\" เขาไม่ใช่นักการฑูต เพราะนักการฑูตที่ดีจะไม่ปฏิเสธใคร  </li>\n<li>เมื่อสุภาพสตรีพูดว่า \"ไม่\" หล่อนมีความหมายว่า \"อาจจะ\" เมื่อสุภาพสตรีพูดว่า \"อาจจะ\" หล่อนมีความหมายว่า \"ใช่ หรือ ได้\" เมื่อสุภาพสตรีพูดว่า \"ใช่ หรือ ได้\" หล่อนไม่ใช่สุภาพสตรี  </li>\n<li>คิดทำการใหญ่ อย่าสนใจเรื่องเล็กน้อย  </li>\n<li>ตาสามารถมองเห็นสิ่งที่ไกลได้ แต่ไม่สามารถ มองเห็นคิ้วของตน คนส่วนใหญ่ใส่ใจกับผลได้ระยะสั้นเท่านั้น แต่คนฉลาดอย่างแท้จริงจะมองไปยังอนาคต  </li>\n<li>อำนาจที่ปราศจากเหตุผล คือ อำนาจของคนพาล อำนาจที่ปราศจากความเมตตา คือ อำนาจที่นำมาซึ่งความปราชัย  </li>\n<li>ยามเรืองรุ่งพุ่งเปรี้ยงดุจเสียงฟ้า แม้เทวายังสยบหลบทางให้ จะหยิบดาวเดือนชมก็สมใจ คงร้องให้วันหนึ่งแน่ คราวแพ้มี  </li>\n<li>ตัดไผ่อย่าไว้หน่อ ฆ่าพ่ออย่าเหลือลูก คิดทำการใหญ่ ใจคอต้อง...มหาญ  </li>\n<li>ข้าพเจ้ายอมทรยศต่อคนทั้งโลก ดีกว่าให้คนในโลกทรยศต่อข้าพเจ้า  </li>\n<li>เป็นแม่ทัพแล้วไม่กล้าตัดหัวคน เป็นแม่ทัพที่ดีไม่ได้  </li>\n<li>คนฉลาดปราดเปรื่อง เขานั่งนิ่งสงวนคม  </li>\n<li>ไม่มีใครเลี้ยงอาหารใครเปล่า ๆ โดยไม่หวังผลประโยชน์ตอบแทน  </li>\n<li>ศัตรูที่ร้ายเหลือ ไม่เท่าเกลือเป็นหนอน  </li>\n<li>ความรู้ คือ อำนาจ  </li>\n<li>นั่งภูดูเสือ กัดกัน  </li>\n<li>เหนือฟ้ายังมีฟ้า เหนือคนยังมียอดคน ฉะนั้นจึงอย่าประมาท  </li>\n<li>ถ้าเป็นกษัตริย์ แล้ว ไม่โลภ ก็ เป็นกษัตริย์ ที่ดีไม่ได้ ถ้าเป็นนักบวชแล้วโลภ ก็ เป็นนักบวช ที่ดีไม่ได้  </li>\n<li>ตาสามารถมองเห็นสิ่งที่ไกลได้ แต่ไม่สามารถ มองเห็นคิ้วของตน  </li>\n<li>น้ำไหลลงสู่ที่ต่ำฉันใด เราก็กลายเป็นคนฉลาดในช่วงเวลาลำบากฉันนั้น  </li>\n<li>ดวงอาทิตย์ทำให้ทุกสิ่งกระจ่างชัด แต่ เรายังต้องทำความเข้าใจในส่วนที่มืด ซึ่งยังคงดำรงอยู่  </li>\n</ul>\n","title":"คำคม ขงเบ้ง","date":"2011-12-30 10:13:00"}},"__N_SSG":true}