{"pageProps":{"postData":{"id":"2017-07-22-ubuntu-1404-connect-android-using-mtp.html","contentHtml":"<p>STEP 1<br>\nFirstly we're going to need to install some of the common MTP apps that will be needed. Open up a terminal and type the following two lines one after the other.  </p>\n<p>sudo apt-get install libmtp-common mtp-tools libmtp-dev libmtp-runtime libmtp9  </p>\n<p>sudo apt-get dist-upgrade  </p>\n<p>STEP 2<br>\nThen we're going to amend the fuse.conf file. FUSE is an application that aims to provide a secure method for non privileged users to create and mount their own file system implementations. This option overrides the security measure restricting file access to the user mounting the file system. So all users (including root) can access the files. This option is by default only allowed to root, but this restriction can be removed with a change to the aforementioned fuse.conf file as follows:  </p>\n<p>At the terminal type  </p>\n<p>sudo nano /etc/fuse.conf  </p>\n<p>We want to remove the # from the below line of code for user_allow_other, like so...  </p>\n<p>#/etc/fuse.conf - Configuration file for Filesystem in Userspace (FUSE)  </p>\n<p>#Set the maximum number of FUSE mounts allowed to non-root users.<br>\n#The default is 1000.<br>\n#mount_max = 1000  </p>\n<h1>Allow non-root users to specify the allow_other or allow_root mount options.</h1>\n<p>user_allow_other  </p>\n<p>Now save the file by pressing Ctrl+x, press Y and then Enter.  </p>\n<p>STEP 3  </p>\n<p>We now need to set up some rules for our device that we plan on connecting, but before we do that we need to find out both the vendor and product id  </p>\n<p>Connect your device via an available usb port and from terminal enter  </p>\n<p>lsusb<br>\nThis should bring up an output similar to the following  </p>\n<p>Bus 002 Device 003: ID 0fce:01b1 Sony Ericsson Mobile Communications AB<br>\nBus 002 Device 002: ID 8087:0024 Intel Corp. Integrated Rate Matching Hub<br>\nBus 002 Device 001: ID 1d6b:0002 Linux Foundation 2.0 root hub<br>\nBus 004 Device 001: ID 1d6b:0003 Linux Foundation 3.0 root hub<br>\nBus 003 Device 001: ID 1d6b:0002 Linux Foundation 2.0 root hub<br>\nBus 001 Device 006: ID 0461:4d65 Primax Electronics, Ltd<br>\nBus 001 Device 005: ID 0846:9020 NetGear, Inc. WNA3100(v1) Wireless-N 300  </p>\n<p>You need to look for your device, in this instance my Sony Tablet is at the top of the list, the vendor id is 0fce and product id is 01b1  </p>\n<p>STEP 4<br>\nWe're then going to amend the mtp udev rules as follows, from a terminal type  </p>\n<p>sudo nano /lib/udev/rules.d/69-mtp.rules  </p>\n<p>Then add the below line of code  </p>\n<h1>Sony Xperia Z2 Tablet</h1>\n<p>ATTR{idVendor}==\"0fce\", ATTR{idProduct}==\"01b1\", SYMLINK+=\"libmtp-%k\", ENV{ID_MTP_DEVICE}=\"1\", ENV{ID_MEDIA_PLAYER}=\"1\"  </p>\n<p>Remember what you're changing here is the device name next to the #, this can be whatever you want, the # comments out the code, but for clarity and reference later I would choose the name of your tablet/phone and also the vendor id and product id, they should match what was seen when you issued the lsusb command earlier.  </p>\n<p>Once done, save the file.  </p>\n<p>STEP 5<br>\nThe next step would also be to add a line of code to the 51 android rules file, again from a terminal type  </p>\n<p>sudo nano /etc/udev/rules.d/51-android.rules  </p>\n<p>Then add the following line of code  </p>\n<p>ATTR{idVendor}==\"0fce\", ATTR{idProduct}==\"01b1\", MODE=”0666\"  </p>\n<p>Remember what I have highlighted in red needs to be changed to your device product id and vendor id.  </p>\n<p>Once that is done and the file is saved, remove any usb device currently connected and issue the following commands  </p>\n<p>[B]STEP 6  </p>\n<p>sudo service udev restart  </p>\n<p>Then save any other remaining work you may have open and reboot the system.  </p>\n<p>STEP 7  </p>\n<p>sudo reboot  </p>\n<p>Source: <a href=\"https://ubuntuforums.org/archive/index.php/t-2226702.html\">https://ubuntuforums.org/archive/index.php/t-2226702.html</a></p>\n","title":"Ubuntu 14.04 Connect Android Using MTP","date":"2017-07-22 08:54:00"}},"__N_SSG":true}